app/Http/Controllers/CartController.php

select * from `carts` where `session_id` = 'IYRcsWYhPTMtU3dZUyrXVUacgcOrisI1B3uDMCvZ' limit 1
---
    public function destroy(Request $request)
    {
        $cart = \App\Models\Cart::where('session_id', session()->getId())->first();