app/Http/Controllers/PhotoController.php

select * from `photos` where `idx` = 'ad1' limit 1
---
    public function show(Request $request)
    {
        $photo = \App\Models\Photo::where('idx', $request->id)->first();