app/Models/Cart.php

    public function totalAmount()
    {
        return $this->photoVariations->sum('price');
---
select `photo_variations`.*, `carts_photo`.`cart_id` as `pivot_cart_id`, `carts_photo`.`photo_variation_id` as `pivot_photo_variation_id` from `photo_variations` inner join `carts_photo` on `photo_variations`.`id` = `carts_photo`.`photo_variation_id` where `carts_photo`.`cart_id` = 1