app/Providers/AppServiceProvider.php

    public function boot()
    {
        view::composer('*', function($view) {
            $view->with('cart', \App\Models\Cart::where('session_id', session()->getId())->first());
---
select * from `carts` where `session_id` = 'IYRcsWYhPTMtU3dZUyrXVUacgcOrisI1B3uDMCvZ' limit 1